name = "Alex"           # создать переменную name и присвойте ей значение вашего имени (строка)
print("Name:", name)    # вывести значение переменной name на экран
age = 35                # создать переменную age и присвоить ей значение вашего возраста (целое число)
print("Age:", age)      # вывести значение переменной age на экран
age = age + 10          # перезаписать в age текущее значение переменной age + новое
print("New Age:", age)  # вывести измененное значение переменной age на экран
is_student = True       # создать переменную is_student и присвоить ей значение True (логич. значение)
print("Is Student:", is_student)   # вывести значение переменной is_student на экран
