my_string = input("Введите произвольный текст: ")       # создать переменную my_string и присвоить значение строки
print("Kоличество символов:", len(my_string))           # вывести количество символов введённого текста
print("Строка в верхнем регистре:", my_string.upper())  # вывести строку my_string в верхнем регистре
print("Строка в нижнем регистре:", my_string.lower())   # вывести строку my_string в нижнем регистре
print("Строка без пробелов:", my_string.replace(" ", ""))  # удалить все пробелы
print("Первый символ строки:", my_string[0])            # выведсти первый символ строки
print("Последний символ строки:", "".join(reversed(my_string))[0])  # вывести последний символ строки