# создать переменную my_dict и присвойте ей словарь из нескольких пар ключ-значение
my_dict = {
    "Анна": 21,
    "Света": 25,
    "Евгений": 22,
    "Степан": 27,
}
print("Созданный 'словарь':", my_dict)      # вывести на экран словарь my_dict
print("Значение по существ.ключу:", my_dict.get("Света"))  # вывести на экран одного значения по существующему ключу
print("Значение по отсутст.ключу:", my_dict.get("Жучка"))  # вывести на экран одного значения по отсутствующему ключу без ошибки
my_dict.update({"Саша": 24, "Максим": 26})  # добавить ещё 2 пары того же формата в словарь
print("Удалённое значение:", my_dict.pop("Анна"))  # удалить одну из пар по существующему ключу и вывести значение из этой пары на экран
print(my_dict)  # вывести на экран словарь my_dict

# создать переменную my_set и присвоить ей множество, состоящее из разных типов данных с повторяющимися значениями
my_set = {1, 1, 1, 2, 3, 4, "ABBA", "ABBA", "CHEAT", (1, 2, 3), (1, 2, 3), (1, 1)}
print("Множество новое:", my_set)  # вывести на экран множество my_set (должны отобразиться только уникальные значения)
my_set.update([7, "UPDATE"])                # добавить 2 произвольных элемента в множество my_set, которых ещё нет
my_set.pop()                                # удалить один любой элемент из множества
print("Множество измененное:", my_set)      # вывести на экран измененное множество
